[
{
    "title": "application",
    "content": "<h3>Application</h3><p>The application process is a comprehensive procedure that requires careful attention to detail. As you proceed, you will be required to fill in various input fields that capture essential information about you and your business. This section is critical as the accuracy of the information provided will directly impact the outcome of your application.</p><ol><li><strong>Personal Information:</strong> You will need to enter your full name, date of birth, and contact details. Ensure that this information is accurate and matches the details on your official identification documents.</li><li><strong>Business Information:</strong> Provide detailed information about your business, including its name, registration number, address, and the nature of its operations. This data is crucial for verifying your business's legitimacy and assessing its eligibility for the application process.</li><li><strong>Financial Details:</strong> You will be asked to provide financial information such as your business’s annual revenue, tax identification number, and bank account details. This information helps in evaluating the financial health of your business.</li><li><strong>Upload Documents:</strong> As part of the application process, you may be required to upload certain documents, such as proof of identity, business registration certificates, and financial statements. Make sure that all documents are legible and up to date.</li><li><strong>Review and Submit:</strong> Before submitting your application, review all the information you have entered. Any errors or omissions can delay the processing of your application or result in its rejection. Once you are confident that all the information is accurate, click the 'Submit' button to finalize your application.</li></ol><p>After submission, you will receive a confirmation email. Your application will then be reviewed by our team, and you will be notified of the outcome via email. Keep an eye on your inbox for updates and further instructions.</p>"
  }
]