[
    {
      "title": "audit",
      "content": "<h1>Audit Trail Screen - Help Guide</h1><h2>Purpose of the Screen</h2><p>The 'Audit Trail' screen is designed to allow administrators to view the history of changes made within the system. It provides details such as the user who performed the action, the table affected, the type of action, and the values that were changed.</p><h2>Screen Components</h2><ul><li><strong>Header:</strong><p>Displays 'Audit Trail' as the title of the screen.</p></li><li><strong>Filters:</strong><ul><li><strong>Username or User ID:</strong> Allows users to filter the audit logs by entering a specific username or user ID.</li><li><strong>Table Name:</strong> Allows filtering by the name of the table where the changes were made.</li><li><strong>Action:</strong> Allows filtering by the type of action performed (e.g., Insert, Update, Delete).</li><li><strong>From Date:</strong> Select a starting date for the logs you want to view.</li><li><strong>To Date:</strong> Select an end date for the logs you want to view.</li><li><strong>Search Button:</strong> Click to apply the selected filters and view the relevant audit logs.</li></ul></li><li><strong>Audit Trail Table:</strong><p>This table displays the audit trail results based on the applied filters. The columns include:</p><ul><li><strong>User ID:</strong> The ID of the user who performed the action.</li><li><strong>Table Name:</strong> The name of the table where the changes were made.</li><li><strong>Action:</strong> The type of action that was performed (e.g., Insert, Update, Delete).</li><li><strong>DateTime:</strong> The date and time when the action was performed.</li><li><strong>Old Values:</strong> The previous values before the change (if applicable).</li><li><strong>New Values:</strong> The updated values after the change (if applicable).</li><li><strong>Expand to see Changes:</strong> This column contains an <strong>View Details</strong> button for each row.</li></ul></li></ul><h2>How to Use the Expand Functionality</h2><p>To view the detailed changes (i.e., old and new values) for a specific action, click the <strong>View Details</strong> button in the 'Expand to see Changes' column. Upon clicking, a pop-up will appear displaying both the old and new values for that specific audit entry. This allows you to easily compare the values before and after the change.</p><h2>Pagination Controls</h2><p><strong>Items per page:</strong> You can select how many entries to display per page (e.g., 10, 20, 50).</p><p><strong>Pagination:</strong> Navigate through multiple pages of audit logs using the pagination controls at the bottom of the table.</p><h2>Common Issues</h2><ul><li><strong>No Results in the Audit Trail:</strong> Ensure that you have applied the correct filters and that there are audit logs for the selected date range or user.</li><li><strong>Expand Button Not Working:</strong> If the 'Expand' button doesn't respond, check your browser's pop-up settings to ensure that pop-ups are allowed.</li></ul><h2>Contact Support</h2><p>For further assistance, contact the system administrator or refer to the user manual for troubleshooting steps.</p>"
    }
]
  