[
{
    "title": "backup",
    "content": "<h1>Help Manual for the Backup and Restore Screen</h1><p>This screen allows users to create backups of their data, schedule automated backups, and restore a database from a previous backup.</p><h2>Main Actions:</h2><h3>Create Backup Button:</h3><p>This button allows you to create a backup of the current database immediately.</p><p><strong>Steps:</strong></p><ol><li>Click the <strong>Create Backup</strong> button.</li><li>Wait for confirmation that the backup has been successfully created.</li></ol><h3>Close Schedule Form Button:</h3><p>Clicking this button hides or closes the scheduling form for automated backups. This is useful if you do not wish to schedule a backup at this time.</p><h3>Schedule Backup Form:</h3><p>This form allows users to set up automatic backups at a specified frequency and time.</p><p><strong>Steps:</strong></p><ol><li><strong>Frequency Dropdown</strong>: Select the desired frequency for the backups (e.g., daily, weekly).</li><li><strong>Time Field</strong>: Select the specific time for the backup to be executed.</li><li>Click the <strong>Schedule Backup</strong> button to save the schedule.</li></ol><h3>Restore Database Button:</h3><p>Clicking this button restores the database from the most recent backup.</p><p><strong>Steps:</strong></p><ol><li>Click the <strong>Restore Database</strong> button.</li><li>Confirm the restoration when prompted (optional).</li></ol><h2>Common Issues and Solutions:</h2><h3>Error during Backup Creation:</h3><p>If an error occurs when creating a backup, ensure that:</p><ul><li>The database is available.</li><li>You have sufficient storage space.</li><li>Check the system logs for more detailed error messages.</li></ul><h3>Scheduling Backups:</h3><p>Ensure you choose both a frequency and a valid time before scheduling. The 'Schedule Backup' button will be enabled only when valid options are selected.</p><h3>Restore Process:</h3><p>Restoring a database may overwrite the current database. Ensure you have the correct backup selected before proceeding with a restore.</p>"
  }
] 