[
  {
    "title": "consultantLink",
    "content": "<h1>Help Manual for Link/Delink Screen</h1>\n<p>This screen is used by administrators to manage the linking or delinking of applicants to specific consultants.</p>\n\n<h2>1. Page Overview</h2>\n<ul>\n  <li><strong>Title:</strong> <em>Link/Delink</em> – This screen is for linking available applicants to consultants or delinking those who are already associated.</li>\n  <li><strong>Admin Section:</strong> This section indicates the admin mode for managing consultants and applicants.</li>\n</ul>\n\n<h2>2. Functional Elements</h2>\n\n<ul>\n  <li><strong>Search Consultants Bar:</strong>\n    <ul>\n      <li><strong>Location:</strong> Top-left of the screen.</li>\n      <li><strong>Function:</strong> Allows the admin to search for consultants by typing a name into the search field. The system will filter consultants based on the entered text.</li>\n    </ul>\n  </li>\n  <li><strong>Select Consultant Dropdown:</strong>\n    <ul>\n      <li><strong>Location:</strong> To the right of the search bar.</li>\n      <li><strong>Function:</strong> A dropdown list to select the current consultant being managed. In the image example, \"William Brown\" is selected.</li>\n    </ul>\n  </li>\n  <li><strong>Applicants Linked to [Consultant's Name] Section:</strong>\n    <ul>\n      <li><strong>Location:</strong> Below the consultant selection field.</li>\n      <li><strong>Function:</strong> Displays a list of applicants already linked to the selected consultant (in this case, \"William Brown\").</li>\n      <li><strong>Information Shown:</strong>\n        <ul>\n          <li><strong>Applicant Full Name:</strong> Displays the full name of the linked applicant.</li>\n          <li><strong>Business Name:</strong> Displays the business associated with the applicant.</li>\n          <li><strong>Actions:</strong>\n            <ul>\n              <li><strong>Delink Button (Red):</strong> Used to remove the link between the applicant and the consultant. In this case, clicking the <em>Delink</em> button next to \"Rose Pink\" will delink her from William Brown.</li>\n            </ul>\n          </li>\n        </ul>\n      </li>\n    </ul>\n  </li>\n  <li><strong>Available Applicants Section:</strong>\n    <ul>\n      <li><strong>Location:</strong> Below the list of linked applicants.</li>\n      <li><strong>Function:</strong> Displays a list of applicants not currently linked to the selected consultant.</li>\n      <li><strong>Information Shown:</strong>\n        <ul>\n          <li><strong>Applicant Full Name:</strong> Shows the name of the available applicant.</li>\n          <li><strong>Business Name:</strong> Shows the business name associated with the applicant.</li>\n          <li><strong>Actions:</strong>\n            <ul>\n              <li><strong>Link Button (Blue):</strong> Used to link an available applicant to the selected consultant. For example, clicking <em>Link</em> next to \"Hank Mann\" will link him to William Brown.</li>\n            </ul>\n          </li>\n        </ul>\n      </li>\n    </ul>\n  </li>\n</ul>\n\n<h2>3. Icons and Buttons</h2>\n<ul>\n  <li><strong>Back Button (Top Left):</strong> Allows the admin to go back to the previous page or menu.</li>\n  <li><strong>Chat/Help Icon (Top Right):</strong> Possibly for customer support or guidance if needed.</li>\n</ul>\n\n<h2>4. Actions Flow</h2>\n\n<h3>Linking an Applicant:</h3>\n<ol>\n  <li>Search for or select a consultant using the dropdown.</li>\n  <li>Scroll to the \"Available Applicants\" section.</li>\n  <li>Click the <em>Link</em> button next to the desired applicant.</li>\n  <li>The applicant will now appear in the \"Applicants Linked to [Consultant's Name]\" section.</li>\n</ol>\n\n<h3>Delinking an Applicant:</h3>\n<ol>\n  <li>Search for or select a consultant using the dropdown.</li>\n  <li>In the \"Applicants Linked to [Consultant's Name]\" section, locate the applicant to be delinked.</li>\n  <li>Click the <em>Delink</em> button next to the applicant's name.</li>\n  <li>The applicant will now move to the \"Available Applicants\" section.</li>\n</ol>\n\n<h2>5. User Tips</h2>\n<ul>\n  <li>Ensure the correct consultant is selected before performing any linking or delinking actions.</li>\n  <li>Use the search bar to quickly find specific consultants.</li>\n  <li>Always review the applicant's details (name and business) to avoid linking or delinking the wrong person.</li>\n</ul>"
  }
]
