[
    {
      "title": "createApplicant",
      "content": "<h1>Create New Applicant</h1><p>Welcome to the 'Create New Applicant' page. Follow the steps below to create a new applicant. Please note that all fields are mandatory, and you will not be able to submit the form unless everything is filled out correctly.</p><ol><li><strong>Title:</strong> Select the appropriate title for the applicant (e.g., Mr., Ms., Dr., etc.) from the dropdown list.</li><li><strong>Name:</strong> Enter the first name of the applicant. This is a required field, so make sure to input the correct name.</li><li><strong>Surname:</strong> Enter the surname (last name) of the applicant. This is a required field, and must not be left blank.</li><li><strong>Email:</strong> Enter a valid email address for the applicant. Example: 'john.doe@example.com'. Ensure that there are no errors in the format, as this will be used to contact the applicant.</li><li><strong>CellPhone Number:</strong> Input the applicant's mobile phone number in the format: 'starting with a 0 and is 10 digits long'. This is essential for communication regarding the applicant's status.</li><li><strong>Business Name:</strong> Enter the applicant's business or organization name. If the applicant does not have a business, you can enter 'N/A'. However, this field cannot be left blank.</li></ol><h2>Finalizing the Application</h2><p>Once all fields are filled:</p><ul><li><strong>Create Button (Blue):</strong> Click this button to submit the form and create the applicant profile. Ensure that every field has been filled correctly, as the system will alert you if something is missing or incorrectly entered.</li><li><strong>Cancel Button (Red):</strong> Clicking this button will discard the form and return you to the previous screen without saving any information.</li></ul><h2>Important Notes</h2><ul><li>All fields on this form are required. If any field is left empty or invalid (such as an incorrectly formatted email address), you will be unable to create a new applicant until the issue is resolved.</li><li><strong>Reviewing Information:</strong> Double-check all information, especially the email address and phone number, before submitting, as these details will be used to communicate with the applicant.</li></ul><p>If you have any questions or need further assistance, please contact support.</p>"
    }
]
  