[
    {
      "title": "getConsultants",
      "content": "<h1>View Consultants</h1><p>Welcome to the 'View Consultants' screen. This page allows you to search for, view, and manage the consultants available in the system.</p><h2>Page Overview</h2><p>This section provides a brief overview of the key components of the page.</p><ol><li><strong>Search Bar:</strong> Use the search bar to look up consultants by entering their name, email, or other details. As you type, the list of consultants will automatically filter based on your search criteria.</li><li><strong>Consultant Table:</strong> The table below the search bar displays key information about each consultant, including:</li></ol><ul><li><strong>Full Name:</strong> The full name of the consultant.</li><li><strong>Email:</strong> The email address of the consultant.</li><li><strong>Cell Number:</strong> The mobile number of the consultant for direct contact.</li><li><strong>View:</strong> A link or button to view more detailed information about the consultant or to perform actions related to the consultant.</li></ul><h2>Managing Consultants</h2><p>This section explains how to manage the consultants displayed on the screen.</p><ul><li><strong>Items per Page:</strong> Below the table, you can adjust how many consultants are displayed at a time. Options include showing 10, 25, or more consultants per page.</li><li><strong>Pagination Controls:</strong> If the list of consultants is long, you can navigate through multiple pages using the pagination buttons located at the bottom of the table. These buttons allow you to go to the next page, previous page, or jump to a specific page.</li></ul><h2>Important Notes</h2><ul><li><strong>Empty Table:</strong> If no consultants are available or your search query does not match any consultants, the table will display '0 of 0' and show no entries.</li><li><strong>Sorting:</strong> You can click on the column headers (e.g., Full Name, Email, Cell Number) to sort the consultants alphabetically or numerically.</li><li><strong>Contact Support:</strong> If you encounter any issues while using the page or need further assistance, please contact support for help.</li></ul>"
    }
  ]
  