[
    {
      "title": "managerLink",
      "content": "<h1>Help Manual for Link/Delink Screen</h1>\n<p>This screen is used by administrators to manage the linking or delinking of consultants to specific consultant managers.</p>\n\n<h2>1. Page Overview</h2>\n<ul>\n  <li><strong>Title:</strong> <em>Link/Delink</em> – This screen is for linking available consultants to consultant managers or delinking those who are already associated.</li>\n  <li><strong>Admin Section:</strong> This section indicates the admin mode for managing consultants and consultant managers.</li>\n</ul>\n\n<h2>2. Functional Elements</h2>\n\n<ul>\n  <li><strong>Search Consultants Bar:</strong>\n    <ul>\n      <li><strong>Location:</strong> Top-left of the screen.</li>\n      <li><strong>Function:</strong> Allows the admin to search for consultants by typing a name into the search field. The system will filter consultants based on the entered text.</li>\n    </ul>\n  </li>\n  <li><strong>Select Consultant Dropdown:</strong>\n    <ul>\n      <li><strong>Location:</strong> To the right of the search bar.</li>\n      <li><strong>Function:</strong> A dropdown list to select the current consultant being managed. In the image example, \"William Brown\" is selected.</li>\n    </ul>\n  </li>\n  <li><strong>Consultant Linked to [Consultant Manager's Name] Section:</strong>\n    <ul>\n      <li><strong>Location:</strong> Below the consultant selection field.</li>\n      <li><strong>Function:</strong> Displays a list of consultants already linked to the selected consultant manager (in this case, \"William Brown\").</li>\n      <li><strong>Information Shown:</strong>\n        <ul>\n          <li><strong>Consultant Full Name:</strong> Displays the full name of the linked consultant.</li>\n                  <li><strong>Actions:</strong>\n            <ul>\n              <li><strong>Delink Button (Red):</strong> Used to remove the link between the consultant and the consultant manager. In this case, clicking the <em>Delink</em> button next to \"Rose Pink\" will delink her from William Brown.</li>\n            </ul>\n          </li>\n        </ul>\n      </li>\n    </ul>\n  </li>\n  <li><strong>Available Consultants Section:</strong>\n    <ul>\n      <li><strong>Location:</strong> Below the list of linked consultants.</li>\n      <li><strong>Function:</strong> Displays a list of consultants not currently linked to the selected consultant manager.</li>\n      <li><strong>Information Shown:</strong>\n        <ul>\n          <li><strong>Consultant Full Name:</strong> Shows the name of the available consultant.</li>\n                  <li><strong>Actions:</strong>\n            <ul>\n              <li><strong>Link Button (Blue):</strong> Used to link an available consultant to the selected consultant manager. For example, clicking <em>Link</em> next to \"Hank Mann\" will link him to William Brown.</li>\n            </ul>\n          </li>\n        </ul>\n      </li>\n    </ul>\n  </li>\n</ul>\n\n<h2>3. Icons and Buttons</h2>\n<ul>\n  <li><strong>Back Button (Top Left):</strong> Allows the admin to go back to the previous page or menu.</li>\n  <li><strong>Chat/Help Icon (Top Right):</strong> Possibly for customer support or guidance if needed.</li>\n</ul>\n\n<h2>4. Actions Flow</h2>\n\n<h3>Linking a Consultant:</h3>\n<ol>\n  <li>Search for or select a consultant using the dropdown.</li>\n  <li>Scroll to the \"Available Consultants\" section.</li>\n  <li>Click the <em>Link</em> button next to the desired consultant.</li>\n  <li>The consultant will now appear in the \"Consultants Linked to [Consultant Manager's Name]\" section.</li>\n</ol>\n\n<h3>Delinking a Consultant:</h3>\n<ol>\n  <li>Search for or select a consultant using the dropdown.</li>\n  <li>In the \"Consultants Linked to [Consultant Manager's Name]\" section, locate the consultant to be delinked.</li>\n  <li>Click the <em>Delink</em> button next to the consultant's name.</li>\n  <li>The consultant will now move to the \"Available Consultants\" section.</li>\n</ol>\n\n<h2>5. User Tips</h2>\n<ul>\n  <li>Ensure the correct consultant is selected before performing any linking or delinking actions.</li>\n  <li>Use the search bar to quickly find specific consultants.</li>\n  <li>Always review the consultant's details (name and business) to avoid linking or delinking the wrong person.</li>\n</ul>"
    }
  ]
  