[
{
    "title": "newEmployee",
    "content": "<h1>Add New Employee</h1>\n<p>The <strong>Add New Employee</strong> screen allows you to create a new employee profile by filling out a form with specific fields. All fields must be completed in order to successfully add the employee.</p>\n\n<h2>Fields Explanation</h2>\n<ul>\n  <li><strong>Title:</strong> <br/>Select the appropriate title for the employee from the dropdown. Available options might include 'Mr.', 'Mrs.', 'Ms.', 'Dr.', etc.</li>\n  <li><strong>Name:</strong> <br/>Enter the employee's first name in this field. Ensure that only alphabetic characters are used.</li>\n  <li><strong>Surname:</strong> <br/>Enter the employee's surname (last name). Like the name field, this should only contain alphabetic characters.</li>\n  <li><strong>Email:</strong> <br/>Provide the employee's valid email address. Ensure the email is correctly formatted (e.g., example@domain.com).</li>\n  <li><strong>Cell Number:</strong> <br/>Enter the employee's phone number. This should be in a valid format, consisting of numeric digits only, with or without country codes (e.g., +1234567890 or 0123456789).</li>\n  <li><strong>Role:</strong> <br/>Select the employee’s role from the dropdown list. This could be roles such as 'Manager,' 'Assistant,' 'Engineer,' etc.</li>\n</ul>\n\n<h2>Buttons</h2>\n<ul>\n  <li><strong>Add Employee:</strong> <br/>Clicking this button will submit the form to create the new employee. All fields must be correctly filled; otherwise, the system will not allow submission.</li>\n  <li><strong>Cancel:</strong> <br/>Clicking the Cancel button will discard the entered details and return you to the previous screen without saving any information.</li>\n</ul>\n\n<h2>Important Notes</h2>\n<ul>\n  <li><strong>Mandatory Fields:</strong> All fields (Title, Name, Surname, Email, Cell Number, and Role) must be filled in for the employee to be successfully added. If any field is left blank, you will not be able to proceed.</li>\n  <li><strong>Error Messages:</strong> If you try to submit the form with missing or incorrectly formatted information (e.g., an invalid email format or missing phone number), error messages will appear below the respective fields. Make sure to resolve all errors before submitting.</li>\n  <li><strong>Validation:</strong>\n    <ul>\n      <li>Ensure that the email format is valid.</li>\n      <li>The phone number should be numeric.</li>\n      <li>The role should be selected from the dropdown.</li>\n    </ul>\n  </li>\n</ul>"
  }
]  