[
    {
     
          "title": "viewEmployee",
          "content": "<h1>View Employees Screen - Help Guide</h1><h2>Purpose of the Screen</h2><p>The 'View Employees' screen allows administrators to view a list of all registered employees within the system. You can search for specific employees, check their details, and view additional information about their roles and accounts.</p><h2>Screen Components</h2><ul><li><strong>Header:</strong><p>Displays 'View Employees' as the title of the screen.</p></li><li><strong>Search Bar:</strong><p><strong>Function:</strong> Allows users to search for an employee by typing the full name or email in the search box.</p><p><strong>Usage:</strong> Begin typing the name or email of an employee. The list will filter based on your input to show matching results.</p></li><li><strong>Employee List:</strong><p>The table displays a list of employees with the following columns:</p><ul><li><strong>Full Name:</strong> Displays the employee's full name.</li><li><strong>Email:</strong> The email address registered for the employee.</li><li><strong>Role:</strong> The role assigned to the employee (e.g., Administrator, User, etc.).</li><li><strong>View Button:</strong> Click this button to view more details about the employee.</li></ul></li><li><strong>Pagination Controls:</strong><p><strong>Items per page:</strong> You can select how many employees to display per page (e.g., 10, 20, 50).</p><p><strong>Pagination:</strong> Navigate between pages if there are more employees than can fit on one page.</p></li></ul><h2>How to Use This Screen</h2><ul><li><strong>Search for an Employee:</strong><p>Enter the employee's name or email in the search bar. The list will update automatically to show matching results.</p></li><li><strong>View Employee Details:</strong><p>After finding the desired employee in the list, click the 'View' button in the 'View' column to see more detailed information. Once clicked, the system will display additional details about the employee, including their full profile and status. You will also see a <strong>Disable Employee</strong> button, which can be used to disable the employee's account if necessary. The button will only be available for active employees. Once disabled, the employee will no longer have access to the system, and the button will reflect their disabled status.</p></li><li><strong>Paginate Through the List:</strong><p>Use the pagination controls at the bottom of the table to navigate through multiple pages of employees. You can also adjust the number of entries shown per page using the dropdown.</p></li></ul><h2>Common Issues</h2><ul><li><strong>No Results in Search:</strong><p>Ensure that you are entering the correct employee name or email. The search is case-insensitive.</p></li><li><strong>Pagination Issues:</strong><p>If there are no entries on the page, you may have moved past the last available page. Try selecting a different number of items per page.</p></li></ul><h2>Contact Support</h2><p>For further assistance, contact the system administrator or refer to the user manual for troubleshooting steps.</p>"
    }
      
      
]
  